Catalogs/НастройкиПодключения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>НастройкиПодключения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресСервера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ОбщийПодключение/Ext/Module.bsl
Функция ПолучитьПараметрыПодключения() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	НастройкиПодключения.Пользователь КАК Пользователь,
	|	НастройкиПодключения.Пароль КАК Пароль,
	|	НастройкиПодключения.АдресСервера КАК АдресСервера
	|ИЗ
	|	Справочник.НастройкиПодключения КАК НастройкиПодключения";
	ТаблицаРезультат = Запрос.Выполнить().Выгрузить();
	Если ТаблицаРезультат.Количество()>0 Тогда 
		СтруктураПодключения = Новый Структура;
		Для каждого стрТаблицы Из ТаблицаРезультат Цикл 
			СтруктураПодключения.Вставить("Пользователь",стрТаблицы.Пользователь); 	
			СтруктураПодключения.Вставить("Пароль",стрТаблицы.Пароль); 	
			СтруктураПодключения.Вставить("АдресСервера",стрТаблицы.АдресСервера); 	
		КонецЦикла;
		Возврат СтруктураПодключения;	
	КонецЕсли;	
КонецФункции
